n = int(input("Введите число от 1 до 99: "))

if 1 <= n <= 99:
    # Особый случай: числа 11-14 всегда "копеек"
    if 11 <= n % 100 <= 14:
        word = "копеек"
    elif n % 10 == 1:
        word = "копейка"
    elif 2 <= n % 10 <= 4:
        word = "копейки"
    else:
        word = "копеек"

    print(f"{n} {word}")
else:
    print("Ошибка: число должно быть от 1 до 99!")

# КИНОТЕАТР


# 1. Начало
# 2. Прийти в кинотеатр
# 3. Выбрать фильм и сеанс
# 4. Проверить есть ли билеты?
# если нет выбрать другой сеанс(вернуться к шагу 2)
# если да купить билет
# 5. Нужны ли попкорн/напитки?
# если да купить попкорн/напитки
# если нет перейти дальше
# 6. Показать билет контролеру
# 7. Зайти в зал,найти свое место
# 8. Смотреть фильм до конца
# 9. Фильм закончился?
# если нет продолжать смотреть (вернуться к шагу 7)
# если да выйти из зала
# 10. Конец


# [Начало]

# [Прийти в кинотеатр]

# [Выбрать фильм и сеанс]

# [проверить есть ли билеты]
# <есть билеты?> --нет--> [выбрать другой сеанс] -> (вверх)
#  ->да [Купить билеты]

# [Нужны ли попкорн/напиток?]
# -->если да купить попкорн/напиток
# -->если нет перейти дальше

# [Показать билет]
#
# [Зайти в зал найти свое место]
#
# [Смотреть фильм]
# <Фильм закончился?> --нет--> (вверх)
#  -->да

# [Выйти из зала]
#
# [Конец]

# ЕЗДА НА ВЕЛОСИПЕДЕ

# 1.Начало
# 2.Осмотреть велосипед
# есть ли неисправности если да,отремонтировать или отказаться от поездки, конец.
# если исправен продолжить
# 3.сесть на велосипед
# 4.крутить педали
# 5.ехать по маршруту
# 6.доехали до своей точки?
# если нет продолжить ехать вернуться (к шагу 4)
# если да остановится
# 7.слезть с велосипеда
# 8.припарковать велосипед
# 9.конец


# [Начало]
#
# [Осмотреть велосипед]
# <есть ли неисправности> -->если да отремонтировать или отказаться , конец
# <если исправен> --> продолжить
#
# [Сесть на велосипед]
#
# [Крутить педали]
#
# [Ехать по маршруту]
#
# [Доехали до своей точки?]
# <если нет> -->продолжить ехать <вернуться к шагу 4>
# <если да> --> остановиться
#
# [Слезть с велосипеда]
#
# [Припарковать велосипед]
#
# [Конец]


# ПОКУПКА ТЕЛЕФОНА

# 1.Начало
# 2.определить бюджет
# 3.прийти в магазин
# 4.найти телефоны по бюджету
# 5.сравнить характеристики
# 6.есть ли телефон в наличие?
# если нет вернуться к шагу 4
# если да проверить комплектацию
# 7.комплектация полная?
# если нет обратиться к консультанту
# если да покупаем
# 8.получить чек и гарантию
# 9.конец

#
# [Начало]
#
# [Определить бюджет]
#
# [Прейти в магазин]
#
# [Найти телефон по бюджету]
#
# [Сравнить характеристики]
#
# [Есть ли телефон в наличие?]
# <если нет> --> вернуться к шагу 4
# <если да > --> проверить комплектацию
#
# [Комплектация полная?]
# <если нет> --> замена
# <если да> --> покупаем
#
# [Получить чек и гарантию]
#
# [Конец]






