def task_and_sort():

    original_list = [3, 7, 2, 5, 2, 8, 3, 9, 5, 1, 7, 4, 3, 6, 1]

    print(f"Исходный список {original_list}")
    print("Отфильтруйте список оставив только уникальные значения")


    filter_values = []
    for item in original_list:
        if original_list.count(item) == 1:
            filter_values.append(item)

    print("\nОчищенный список")
    print(filter_values)


    n = len(filter_values)
    for i in range(n):
        for j in range(0, n - i - 1):
            if filter_values[j] > filter_values[j + 1]:
                filter_values[j], filter_values[j + 1] = filter_values[j + 1], filter_values[j]

    print("\nРезультат отсортированный очищенный список")
    print(filter_values)



if __name__ == "__main__":
    task_and_sort()




    #
    #
    # Объяснение
    # кода:
    # Фильтрация(original_list.count(item) == 1):
    # Мы
    # проходим
    # циклом
    # for по каждому числу в списке.
    # Для
    # каждого
    # числа
    # мы
    # спрашиваем
    # у
    # списка: "Сколько раз ты встречаешься?"(.count()).
    # Если
    # ответ
    # "1 раз", мы
    # добавляем
    # его
    # в
    # новый
    # список
    # unique_values.
    # Числа
    # вроде
    # 3
    # или
    # 7
    # встречаются
    # 2
    # или
    # 3
    # раза, поэтому
    # условие == 1
    # для
    # них
    # ложно, и
    # они
    # не
    # попадают
    # в
    # итоговый
    # список.Это
    # объясняет, почему
    # в
    # результате[8, 9, 4, 6].
    # Сортировка(Bubble
    # Sort):
    # Задание
    # запрещает
    # использовать
    # встроенную
    # функцию.sort()
    # или
    # sorted().
    # Я
    # написал
    # классический
    # алгоритм
    # "пузырьковой сортировки".
    # Два
    # вложенных
    # цикла
    # проходят
    # по
    # списку.Если
    # левое
    # число
    # больше
    # правого(unique_values[j] > unique_values[j + 1]), они
    # меняются
    # местами.
    # В
    # итоге
    # самые
    # большие
    # числа
    # "всплывают"
    # в
    # конец
    # списка, и
    # список
    # становится
    # упорядоченным
    # по
    # возрастанию: [4, 6, 8, 9].